print("문자 선택 연산자에 대해 알아볼까요?")
print("안녕하세요"[0])          # 문자열은 '0번째'부터 시작한다
print("안녕하세요"[1])
print("안녕하세요"[2])
print("안녕하세요"[3])
print("안녕하세요"[4])
print()
print("문자를 뒤에서부터 선택해볼까요?")
print("안녕하세요"[-1])         # 뒤에서 부터 시작할 때는 -1부터시작이다 (종이를 만다고 생각)
print("안녕하세요"[-2])
print("안녕하세요"[-3])
print("안녕하세요"[-4])
print("안녕하세요"[-5])         
print()
print("안녕하세요"[1:3])        # 3은 포함되지 않고, 3전인 두번째 열까지만 출력한다
print("안녕하세요"[:3])         # 처음부터 3전까지 출력
print("안녕하세요"[2:])         # 처음부터 2전까지 생략
print()
hello = "안녕하세요"
print(hello[0:2])
hello
print()
print(len("안녕하세요"))
print(len("안녕하세요 저는 임재웅입니다. "))
print()




