# foods = {
#     "떡볶이":"단무지",
#     "라면":"김치",
#     "피자":"피클",
#     "맥주":"땅콩",
#     "치킨":"치킨무",
#     "삼겹살":"상추"
# }

# while (True) :
#     myfood = input(str(list(foods.keys())) + "중 좋아하는 음식은? : ")
#     if myfood in foods : 
#         print("<%s> 궁합음식은 <%s>입니다." % (myfood, foods.get(myfood)))
#     elif myfood == "끝" :
#         break
#     else:
#         print("그런 음식이 없습니다. 확인해보세요.")
# ------------------------------------------------------------------------------------------------
# baby = {
#     "개" : "강아지",
#     "소" : "송아지",
#     "말" : "망아지",
#     "사람" : "아기"
# }

# while (True) : 
#     ani_babe = input(str(list(baby.keys())) + "알고싶은 아기의 이름 : " )
#     if ani_babe in baby : 
#         print("<%s>의 아기의 이름은 <%s>입니다" % (ani_babe, baby.get(ani_babe)))
#     elif ani_babe == "끝" :
#         break
#     else:
#             print("그런 동물은 없습니다 확인하세요")
# ------------------------------------------------------------------------------------------------
# for i in reversed(range(5)):
#   print("현재반복변수 : {}".format(i))
# ------------------------------------------------------------------------------------------------
# i=0
# while i<4:
#     print("%s번째 반복입니다."%(i))
#     i+=1
# print(i)
# while i<9:
#     print("%s번째 반복입니다."%(i))
#     i+=1
# ------------------------------------------------------------------------------------------------



