# a=[1,2,1,2,]
# b=2

# while b in a:
#     a.remove(b)
# print(a)
# ------------------------------------------------------------------------------------------------
# import time
# number =0
# b=time.time()+5
# while time.time()<b:
#     number+=1
# print ("5초동안 {}번 반복했습니다".format(number))
# ------------------------------------------------------------------------------------------------
# i=0
# while True:
#     print("{}번쨰 반복문 입니다.".format(i))
#     i+=1
#     if i>5:
#         print("5회 초과하여 반복을 종료합니다")
#         break
#     input_text =input("> 종료하시겠습니까?(y/n) : ")
#     if input_text in ["y","Y"]:
#         print("반복을 종료합니다.")
#         break
# ------------------------------------------------------------------------------------------------
# numbers = [5,15,6,20,7,25]
# for number in numbers:
#     if number <10:
#         continue
#     print (number)
# ------------------------------------------------------------------------------------------------
# numbers = [103,52,273,32,77]
# print(min(numbers))
# print(max(numbers))
# print(sum(numbers))
# ------------------------------------------------------------------------------------------------




